#+TITLE: Advent of Code
#+AUTHOR: Jeroen Faijdherbe

* TODO Intro
bla bla [[https://adventofcode.com]] bla bla =elisp skills= bla bla =literate programming= blabla.

** Example
#+begin_src emacs-lisp
(message "Hello World!")
#+end_src

#+RESULTS:
: Hello World!

* Entries
- [[file:day_01.org][Day 01, both solved]]
- [[file:day_02.org][Day 02, both solved]] (two days late)
- [[file:day_03.org][Day 03, both solved]] (one day late)
- [[file:day_04.org][Day 04, both solved]] flawless. (in less time than anticipated)
- [[file:day_05.org][Day 05, both solved]] damn, this ain't the most beautiful code...
- [[file:day_06.org][Day 06, both solved]] hah, the second part was jut adjusting a single variable
